tutorial/thermalContactResistance/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        nFaces          2;
        startFace       1;
    }
    minX
    {
        type            patch;
        nFaces          1;
        startFace       3;
    }
    maxX
    {
        type            patch;
        nFaces          1;
        startFace       4;
    }
    minY
    {
        type            wall;
        nFaces          2;
        startFace       5;
    }
    minZ
    {
        type            wall;
        nFaces          2;
        startFace       7;
    }
    maxZ
    {
        type            wall;
        nFaces          2;
        startFace       9;
    }
)

// ************************************************************************* //
